# Напишите функцию my_sort, которая принимает двумерный массив n x n, а возвращает элементы массива,
# расположенные от самых крайних элементов до среднего элемента, таким образом,
# чтобы происходило перемещение по часовой стрелке.

def my_sort(matrix):
    result = []

    while matrix:
        # Забираем первую строку (идём слева направо по первой строке)
        result.extend(matrix.pop(0))

        # Забираем последний столбец (идём сверху вниз по последнему столбцу)
        if matrix and matrix[0]:
            for row in matrix[:-1]:
                result.append(row.pop())

        # Забираем последнюю строку (идём справа налево по нижней строке)
        if matrix:
            result.extend(matrix.pop()[::-1])

        # Забираем первый столбец (идём снизу вверх по первому столбцу)
        if matrix and matrix[0]:
            for row in matrix[::-1]:
                result.append(row.pop(0))

    return result

print(my_sort([ [1,2,3], [4,5,6], [7,8,9] ]))
print(my_sort([ [1,2,3], [8,9,4], [7,6,5] ]))
print(my_sort([ [1,2,3,4], [5,6,7,8], [9,10,11,12] ]))