# Дано натуральное число A > 1. Определите, каким по счету числом Фибоначчи оно является.
# То есть выведите такое число n, что phi_n=A. Если А не является числом Фибоначчи, выведите число -1.

A = int(input())
a, a_next = 0, 1
n = 0

while a <= A:
    if a == A:
        print(n)
        break
    a, a_next = a_next, a + a_next
    n += 1
else:
    print(-1)