# Сначала на вход поступает длина последовательности N. Затем элементы последовательности – целые числа.
# Напишите программу, которая подсчитывает количество положительных чисел среди элементов последовательности.

N = int(input())
count = 0

for _ in range(N):
    if int(input()) > 0:
        count += 1

print(count)