# Напишите программу, которая в последовательности чисел находит сумму двузначных чисел, кратных 8. 
#Программа в первой строке получает на вход число n - количество чисел в последовательности, во второй строке -- n чисел,
#входящих в данную последовательность.

N= input("Введите количество чисел в последовательности: ")
Posled = list(map(int, input('Введите последовательность чисел: ').split(' ')))
sum=0

for i in range(len(Posled)):
  if 9 < Posled[i] < 100 and Posled[i]%8==0:
    sum+=Posled[i]

print(sum)