#Последовательность состоит из натуральных чисел и завершается числом 0. Определите количество элементов 
#этой последовательности, которые равны ее наибольшему элементу

i = int(input())
max = i
count = 0
if i != 0:
  count=1
  while i != 0:
    i = int(input())
    if i > max:
      max = i
      count=1
    elif i == max:
        count += 1
print(count)