#Даны два числа. Определить цифры, входящие в запись как первого, так и второго числа. 
#Программа должна вывести цифры, которые имеются в обоих числах, через пробел.
#Цифры выводятся в порядке их нахождения в первом числе

a = input("Введите первое число: ")
b = input("Введите второе число: ")
Spisok = []
for i in a:
  for j in b:
    if i==j and Spisok.count(i) == 0:
      Spisok.append(i)
print(*Spisok,sep=' ')