#Дано пятизначное число. Найдите произведение его цифр
n= input("Введите пятизначное число: ")
umnozh=1
for i in n:
  umnozh=umnozh*int(i)
print("Произведение цифр числа: ", umnozh)