# Дано трехзначное число. Переверните его, а затем выведите
n = input("Введите трехзначное число: ")[::-1]
print(n)