"""
Вводится натуральное число N, а затем N чисел.
Найти средее арифметическое всех чисел кратных 3.
Если таких чисел нет, то вывести -1.

Пример ввода:
6
6
3
2
42
5
12

Пример вывода:
10.5
"""

n, div_sum, div_count = int(input("Введите количество чисел: ")), 0, 0
for _ in range(n):
    num = int(input())
    if num % 3 == 0:
        div_sum += num
        div_count += 1

print("Среднее арифметическое: ", div_sum / div_count if div_count > 0 else -1)
