"""
Напишите функцию my_sort, которая принимает двумерный массив n x n, а возвращает элементы массива,
расположенные от самых крайних элементов до среднего элемента, таким образом, чтобы происходило перемещение по часовой стрелке.

То есть функция должна преобразовывать
array = [ [1,2,3], [4,5,6], [7,8,9] ]
my_sort(array) #=> [1,2,3,6,9,8,7,4,5]

Еще один пример работы функции:
array = [ [1,2,3], [8,9,4], [7,6,5] ]
my_sort(array) #=> [1,2,3,4,5,6,7,8,9]
"""


def my_sort(matrix):
    result = []
    n = len(matrix)
    l, r, t, b = 0, n - 1, 0, n - 1

    while l <= r and t <= b:
        result += [matrix[t][j] for j in range(l, r + 1)]
        t += 1  # двигаемся вниз
        result += [matrix[i][r] for i in range(t, b + 1)]
        r -= 1  # двигаемся влево
        if t <= b:
            result += [matrix[b][j] for j in range(r, l - 1, -1)]
            b -= 1  # двигаемся вверх
        if l <= r:
            result += [matrix[i][l] for i in range(b, t - 1, -1)]
            l += 1  # двигаемся вправо

    return result


print(my_sort(
    [[1, 2, 3],
     [4, 5, 6],
     [7, 8, 9]]
))  # [1, 2, 3, 6, 9, 8, 7, 4, 5]

print(my_sort(
    [[1, 2, 3],
     [8, 9, 4],
     [7, 6, 5]]
))  # [1, 2, 3, 4, 5, 6, 7, 8, 9]

print(my_sort(
    [[1, 2, 3, 2],
     [8, 9, 4, 3],
     [7, 6, 5, 7],
     [7, 4, 3, 8]]
))  # [1, 2, 3, 2, 3, 7, 8, 3, 4, 7, 7, 8, 9, 4, 5, 6]
