"""
Дано натуральное число A > 1.
Определите, каким по счету числом Фибоначчи оно является, то есть выведите такое число n, что psi_n=A.
Если А не является числом Фибоначчи, выведите число -1.

Пример ввода:
8

Пример вывода:
6
"""

a = int(input("Введите число A: "))

f1, f2, index = 0, 1, 1
while f2 < a:
    f1, f2 = f2, f1 + f2
    index += 1
print("Номер числа Фибоначчи", index if f2 == a else -1)
