"""
Сначала на вход поступает длина последовательности N.
Затем элементы последовательности – целые числа.
Напишите программу, которая подсчитывает количество положительных чисел среди элементов последовательности.

Пример ввода:
5
1
2
3
-1
-4

Пример вывода:
3
"""

n = int(input("Введите количество чисел в последовательности: "))
numbers = [int(input()) for _ in range(n)]

positive_count = sum([int(num > 0) for num in numbers])

print("Количество положительных чисел: ", positive_count)
