"""
Дано пятизначное число. Найдите произведение его цифр.

Пример ввода:
14962

Пример вывода:
432
"""

num, product = int(input("Введите пятизначное число: ")), 1
for symbol in str(num):
    product *= int(symbol)
print("Произведение цифр: ", product)
