# Задача 3*
# Вводится натуральное число N, а затем N чисел. Найти средее арифметическое всех чисел кратных 3. Если таких чисел нет, то вывести -1
# Пример ввода:
# 6
# 6
# 3
# 2
# 42
# 5
# 12
# Пример вывода:
# 10.5

print("Введите несколько натуральных чисел.\nДля завершения ввода нажмите ENTER либо введите не число/не натуральное число ")
k = 1
triples = 0
count=0
N = input(f"Введите {k}-е число:  ")
while N.isnumeric():
    k += 1
    N = int(N)
    if N%3 == 0:
        triples += N
        count += 1
    N = input(f"Введите {k}-е число:  ")
if triples == 0:
    print (-1)
else:
    print (f"Cредее арифметическое всех чисел, кратных 3:", triples/count)
