#Дано трехзначное число. Найдите сумму его цифр.
#
#Пример ввода:
#
#745
#
#Пример вывода:
#
#16

a=input("Введите 3х-значное число: ")
if a.isnumeric():
    if len(a)!=3:
        print ("Введено НЕ трёхзначное число!")
    else:
        b=int(a)
        c=0
        while b != 0:
            c+=b%10
            b //= 10
        print("Сумма цифр введённого числа: ", c)
else:
    print("Введено НЕ число!")
