#Вводится натуральное число N, а затем N чисел. 
#По данным числам, определите количество чисел, которые равны нулю
N= input("Введите натуральное число N:")
k=0
for _ in range(int(N)):
  i=int(input())
  if i==0:
    k+=1
print ("Количество нулей: ",k)