# Задача 5
# Вводится два целых числа a и b (a≤b).
# Найдите самое большее число на отрезке от a до b, кратное 7.
# Если такого числа нет выведите -1.
# Пример ввода:
# 100
# 500
# Пример вывода:
# 497
print("Введите два целых числа a и b (a≤b)")
a=int(input("Введите число a: "))
b=int(input("Введите число b: "))
if a > b:
    print("Второе число должно быть больше первого!!!")
    exit()
biggest = -1
for k in range(a,b+1):
    if k % 7 == 0:
        biggest = k

print (f"Cамое большoе число на отрезке от a до b, кратное 7: ",biggest)
