#Вводится натуральное число N, а затем N чисел.
#По данным числам, определите количество чисел, которые равны нулю
# Пример ввода:
# 5
# 1
# 8
# 100
# 0
# 12
# Пример вывода:
# 1

print("Введите несколько натуральных чисел.\nДля завершения ввода нажмите ENTER либо введите не число/не натуральное число ")
k = 1
zeros = 0
N = input(f"Введите {k}-е число:  ")
while N.isnumeric():
    k += 1
    N=int(N)
    if N == 0:
        zeros += 1
    N = input(f"Введите {k}-е число:  ")
print (f"Количество нулей среди введённых чисел: ",zeros)
