'''
Задача №1
Дано трехзначное число. Найдите сумму его цифр.

Пример ввода:
745
Пример вывода:
16
'''

n = int(input())
sum_1 = (n // 100) + ((n // 10) % 10) + (n % 10)
print(sum_1)
