'''
Задача №1+
Дано пятизначное число. Найдите произведение его цифр.

Пример ввода:
14962
Пример вывода:
432
'''
n = int(input())

a1 = n // 10000
a2 = (n // 1000) % 10
a3 = (n // 100) % 10
a4 = (n // 10) % 10
a5 = n % 10

print(a1 * a2 * a3 * a4 * a5)