'''
Задача №2
Дано трехзначное число. Переверните его, а затем выведите.

Пример ввода:
843
Пример вывода:
348
'''
n = input()[::-1]
print(n)
