'''
Дано натуральное число A > 1. Определите, каким по счету числом Фибоначчи оно является, то есть выведите такое число n, что F(n)= A
. Если А не является числом Фибоначчи, выведите число -1.

Пример ввода:

8

Пример вывода:

6
'''


A = int(input())

a, b = 0, 1
n = 1 

while b < A:
    a, b = b, a + b
    n = n + 1

if b == A:
    print(n)
else:
    print(-1)


