# Дано трехзначное число. Найдите сумму его цифр
n= input("Введите трехзначное число: ")
sum=0
for i in n:
  sum=sum+int(i)
print("Сумма цифр числа: ", sum)