"""
Задача 1:
Дано трехзначное число. Найдите сумму его цифр.

Пример ввода:
745

Пример вывода:
16
"""


def task1():
    n = input('Введите число: ')
    sum_n = 0
    for i in n:
        sum_n += int(i)
    print('Результат:', sum_n)


"""
Задача 1*:
Дано пятизначное число. Найдите произведение его цифр.

Пример ввода:
14962

Пример вывода:
432
"""


def task1_p():
    n = input('Введите число: ')
    sum_n = 1
    for i in n:
        sum_n *= int(i)
    print('Результат:', sum_n)


if __name__ == "__main__":
    print('Задача 1:')
    task1()
    print('\nЗадача 1*:')
    task1_p()
