"""
Задача 3:
Вводится натуральное число N, а затем N чисел. По данным числам,
определите количество чисел, которые равны нулю.

Пример ввода:
5
1
8
100
0
12

Пример вывода:
1
"""


def task3():
    n = int(input('Введите количество чисел: '))
    k = 0
    for i in range(n):
        if int(input('Введите число: ')) == 0:
            k += 1
    print('Результат:', k)


"""
Задача 3*:
Вводится натуральное число N, а затем N чисел.
Найти среднее арифметическое всех чисел кратных 3. Если таких чисел нет, то вывести -1

Пример ввода:
6
3
2
42
5
12
6

Пример вывода:
15.75
"""


def task3_p():
    n = int(input('Введите количество чисел: '))
    k = 0
    sum_m = 0
    for i in range(n):
        m = int(input('Введите число: '))
        if m % 3 == 0:
            k += 1
            sum_m += m
    print('Результат:', '-1' if (k == 0) else (sum_m / k))


if __name__ == "__main__":
    print('Задача 3:')
    task3()
    print('\nЗадача 3*:')
    task3_p()
