"""
Задача 2:
Дано трехзначное число. Переверните его, а затем выведите.

Пример ввода:
843

Пример вывода:
348
"""


def task2():
    n = input('Введите число: ')
    new_n = n[::-1]
    print('Результат:', new_n)


"""
Задача 2*:
Дано шестизначное число. Найдите суммы его четных и нечетных индексов элементов.
Образуйте из этих сумм одно число и выведите его на экран

Пример ввода:
531893

Пример вывода:
1514
"""


def task2_p():
    n = input('Введите число: ')
    sum_ch = 0
    sum_nch = 0
    for i in range(0, len(n) - 1, 2):
        sum_ch += int(n[i])
        sum_nch += int(n[i + 1])
    print('Результат: ' + str(sum_ch) + str(sum_nch))


if __name__ == "__main__":
    print('Задача 2:')
    task2()
    print('\nЗадача 2*:')
    task2_p()
