#Задача 3*
#Вводится натуральное число N, а затем N чисел. Найти средее арифметическое всех чисел кратных 3. Если таких чисел нет, то вывести -1

N= input("Введите натуральное число N:")
count=0
sum=0
for _ in range(int(N)):
  i=int(input())
  if i%3 ==0:
    sum=sum+i
    count+=1
if count==0:
  print(-1)
else:
  print("Среднее арифметическое:",sum/count)