#Задача 8*
Напишите функцию my_sort, которая принимает двумерный массив n x n, а возвращает элементы массива, расположенные от самых крайних элементов до среднего элемента, таким образом, чтобы происходило перемещение по часовой стрелке.
#Тоесть функция должна преобразовывать array = [ [1,2,3], [4,5,6], [7,8,9] ]
#my_sort(array) #=> [1,2,3,6,9,8,7,4,5]
#Еще один пример работы функции:
#array = [ [1,2,3], [8,9,4], [7,6,5] ] my_sort(array) #=> [1,2,3,4,5,6,7,8,9]



#Проверка

array = [ [1,2,3], [4,5,6], [7,8,9] ]
 print(my_sort(array))