"""
Задача 5:
Вводится два целых числа a и b (a ≤ b).
Найдите самое большее число на отрезке от a до b, кратное 7.
Если такого числа нет выведите -1.

Пример ввода:
100
500

Пример вывода:
497
"""


def task5() -> None:
    a = int(input('Введите первое число: '))
    b = int(input('Введите второе число: '))
    k = b
    while k % 7 != 0:
        k -= 1
    print('Результат:', k)


"""
Задача 5.1:
В цепочках ДНК символы «А» и «Т» дополняют друг друга, как «С» и «G».
Нужно написать программу, которая получайте на вход последовательность ДНК
и на выходе отображает комплементарную ей.

Пример ввода:
GTAT

Пример вывода:
CATA
"""


def task5_1() -> None:
    n = input('Введите цепочку ДНК: ')
    res = ''
    change = {'A': 'T', 'T': 'A', 'C': 'G', 'G': 'C'}
    for i in n:
        if i in change.keys():
            res += change[i]
        else:
            res += i
    print('Результат:', res)


"""
Задача 5*:
По данному числу N распечатайте все целые значения степени двойки,
не превосходящие N, в порядке возрастания.

Пример ввода:
50

Пример вывода:
1 2 4 8 16 32
"""


def task5_p() -> None:
    n = int(input('Введите число: '))
    k = 1
    print('Результат:', end=' ')
    while k < n:
        print(k, end=' ')
        k *= 2
    print()


if __name__ == "__main__":
    print('Задача 5:')
    task5()
    print('\nЗадача 5.1:')
    task5_1()
    print('\nЗадача 5*:')
    task5_p()
