"""
Задача 7:
Напишите программу, которая в последовательности чисел находит сумму двузначных чисел, кратных 8.
Программа в первой строке получает на вход число n - количество чисел в последовательности,
во второй строке - n чисел, входящих в данную последовательность.

Пример ввода:
5
38 24 800 8 16

Пример вывода:
40
"""


def task7() -> None:
    n = int(input('Введите количество чисел: '))
    k = list(map(int, input('Введите последовательность чисел: ').split(' ')))
    sum_k = 0
    for i in k:
        if 9 < i < 100 and i % 8 == 0:
            sum_k += i
    print('Результат:', sum_k)


"""
Задача 7*:
Последовательность состоит из натуральных чисел и завершается числом 0.
Определите количество элементов этой последовательности, которые равны ее наибольшему элементу.

Пример ввода:
1
3
3
1
0

Пример вывода:
2
"""


def task7_p() -> None:
    n = int(input('Введите число: '))
    max_n = n
    k = 1 if n != 0 else 0
    while n != 0:
        n = int(input('Введите число: '))
        if n > max_n:
            max_n = n
            k = 1
        elif n == max_n:
            k += 1
    print('Результат:', k)


if __name__ == "__main__":
    print('Задача 7:')
    task7()
    print('\nЗадача 7*:')
    task7_p()
