# Задача 6
# На ввод подаются N целых чисел, их нужно сохранить в массив
# или список. Затем вывести макимальный элемент.
# Пример ввода:
# 5
# 2
# 3
# 562
# 45
# 21
# Пример вывода:
# 56

num = list(map(int, input("Введите несколько целых чисел, разделяя их пробелом:\n").split()))
i = num[0]
for j in num:
    if j > i:
        i = j
print(f"Максимальный элемент последовательности: ",i)