#Дано шестизначное число. Найдите суммы его четных и нечетных элементов. Образуйте из них этих сумм одно число и выведите его на экран
#
#Пример ввода:
#
#531893
#
#Пример вывода:
#
#1514
print("Дано шестизначное число. Найдите суммы его четных и нечетных элементов. Образуйте из них этих сумм одно число и выведите его на экран")
a=input("Введите шестизначное число: ")
if a.isnumeric():
    if len(a)!=6:
        print ("Введено НЕ шестизначное число!")
    else:
        even=0
        odd=0
        for digit in range(len(a)):
            if digit%2==0:
                even+=int(a[digit])
            else:
                odd+=int(a[digit])
        print("Сумма чётных (по позициям) чисел составляет: ",even, "  Сумма нечётных: ",odd)
        print("Сумма этих двух чисел: ", odd+even)
        print("Сумма обозначенных чисел: ", odd+even)
else:
    print("Введено НЕ число!")
