#Дано пятизначное число. Найдите произведение его цифр.
#
#Пример ввода:
#
#14962
#
#Пример вывода:
#
#432
print("Дано пятизначное число. Найдите произведение его цифр.")
a=input("Введите пятизначное число: ")
if a.isnumeric():
    if len(a)!=5:
        print ("Введено НЕ пятизначное число!")
    else:
        b=int(a)
        c=1
        while b != 0:
            c*=b%10
            b //= 10
        print("Произведение цифр введённого числа: ", c)
else:
    print("Введено НЕ число!")
