# Задача 4*
# Дано натуральное число A > 1. Определите, каким по счету
# числом Фибоначчи оно является, то есть выведите
# такое число n, что φn=A. Если А не является числом
# Фибоначчи, выведите число -1.
# Пример ввода:
# 8
# Пример вывода:
# 6

print ("Введите натуральное число A > 1.\nБудем определять, каким по счёту числом Фибоначчи оно будет")
N = int(input("Ваше число:  "))
i = 1
j = 1
k = 2
count = 2
if N == i:
    print (f"Введённое число является 1м и 2м числом последовательности Фибоначчи")
    exit()
while k < N:
    k = i + j
    i = j
    j = k
    count += 1
    if N == k:
        print(f"Введённое число является ",count,"-м числом последовательности Фибоначчи")
        exit()
print ("-1")
