#Дано трехзначное число. Переверните его, а затем выведите.
#Пример ввода:
#843
#Пример вывода:
#348

number = input()
number_2 = number[2] + number[1] + number[0]
print(number_2)