#Вводится натуральное число N, а затем N чисел. По данным числам, определите количество чисел, которые равны нулю.
#Пример ввода:
#5
#1
#8
#100
#0
#12
#Пример вывода:
#1

n = int(input())
count = 0
for i in range(n):
    num = int(input())
    if num == 0:
        count += 1
print(count)